# RibbonItemEventArgs Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RibbonItemEventArgs Members
RibbonItemEventArgs Class Constructors Methods Properties See Also
---
The RibbonItemEventArgs type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RibbonItemEventArgs | Initializes a new instance of the RibbonItemEventArgs class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Application | The current UIApplication. |

# See Also
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace